Adds use case
